{
  "version" : "1.0",
  "exported_at" : "2026-01-15T20:39:49.569273Z",
  "total_missions" : 16,
  "missions" : [ {
    "category" : "Airspace Operations",
    "why_description" : "Learn to fit GA ops into airline-dense airspace, sharpen radio skills, and reduce intimidation factor.",
    "difficulty" : 7,
    "suggested_route" : "KPAO KWVI KHHR KTOA",
    "route" : "KPAO → coastal route south → request Coastal or Mini Route through LAX Bravo → land at Torrance (KTOA) or Santa Monica (KSMO)",
    "title" : "Class B Ops: LAX Bravo Transition",
    "updated_at" : null,
    "notes" : "Do the SFRA transition. It's pretty cool and I've heard the Mini doesn't get granted much. SFRA transition also sets up good KAVX approach for \"Island Run\" mission. Study LAX VFR charts. Have alternates (e.g., Hawthorne, Compton). Expect precise instructions.",
    "objective" : "Master Class B communication, clearances, and situational awareness in one of the busiest airspaces in the world.",
    "mission_description" : "Fly down the California coast, request the Coastal Route or Mini Route through LAX Bravo.",
    "created_at" : null
  }, {
    "category" : "Airspace Operations",
    "why_description" : "Builds comfort with higher-density ATC environments beyond usual Class D/untowered ops.",
    "difficulty" : 3,
    "suggested_route" : "KPAO KSJC KSMF",
    "route" : "KPAO → KSMF",
    "title" : "First Class C Landing: San Jose (KSJC) or Sacramento (KSMF)",
    "updated_at" : null,
    "notes" : "Be sure to get out of the airplane. The confusing part of Class Cs is dealing with Clearance Delivery, before you call Ground. Expect vectors, sequencing with heavies. Ask for progressive taxi if unsure.",
    "objective" : "Gain confidence mixing with airline traffic under Class C approach control.",
    "mission_description" : "File VFR flight following and land at SJC or SMF. Bonus: request progressive taxi if ground is busy.",
    "created_at" : null
  }, {
    "category" : "Terrain & Environment",
    "why_description" : "Catalina's \"Airport in the Sky\" combines overwater exposure, high terrain, and unusual runway slope.",
    "difficulty" : 9,
    "suggested_route" : "KPAO KSBA KAVX KSMO",
    "route" : "KPAO → Santa Barbara (KSBA) for fuel → Catalina (KAVX)",
    "title" : "Island Run: Catalina (KAVX)",
    "updated_at" : null,
    "notes" : "Read the AFD carefully, and the airport guide. Brief water survival gear and best ditching techniques, just to rehearse the scenarios. Bring a life vest. Study KAVX airport diagram and approach procedures. Be aware of potential updrafts/downdrafts near the island.",
    "objective" : "Practice overwater flight planning, engine-out decision-making, and island runway ops.",
    "mission_description" : "Fly from KPAO → Santa Barbara (KSBA) for fuel, then hop to Catalina. Bring life vests for pilot + pax and wear for the entire flight.",
    "created_at" : null
  }, {
    "category" : "Terrain & Environment",
    "why_description" : "Introduces real-world mountain ops without going to Colorado — a must-have confidence builder.",
    "difficulty" : 9,
    "suggested_route" : "KPAO KAUN KTRK KTVL",
    "route" : "KPAO → Truckee (KTRK)",
    "title" : "Mountain Gateway: Truckee (KTRK) or South Lake Tahoe (KTVL)",
    "updated_at" : null,
    "notes" : "Also introduces blood oxygen monitoring and supplemental O2 use if the pilot is unfamiliar. Review hypoxia symptoms with PIC + passengers before take-off. Depart early to avoid afternoon winds. Lean for takeoff and climb. Plan your climb path for terrain clearance and follow Hwy 80. Study valley entry/exit procedures.",
    "objective" : "High-altitude operations, density altitude awareness, terrain clearance, and mountain downdrafts.",
    "mission_description" : "Morning departure KPAO → TRK/TVL. Focus on climb planning, leaning for takeoff, and valley approaches, use Hwy 80 for safety. Use a pulse O2 meter and become familiar with its use. Consider supplemental O2 if taking a more direct route over high terrain.",
    "created_at" : null
  }, {
    "category" : "Weather & Atmospheric",
    "why_description" : "Coastal ops teach rapid weather evaluation and diversion decision-making in real-world conditions. See what 6sm and 5sm of actual vis look like (then 180).",
    "difficulty" : 3,
    "suggested_route" : null,
    "route" : "KPAO → Half Moon Bay (KHAF) → Monterey (KMRY) → return via Salinas Valley. Talk to Norcal Approach on return.",
    "title" : "Coastal Marine Layer Run: Half Moon Bay (KHAF) & Monterey (KMRY)",
    "updated_at" : null,
    "notes" : "Monitor METARs and TAFs carefully. Be prepared for rapid weather changes and diversions.",
    "objective" : "Learn how marine layer, coastal fog, and microclimates affect VFR navigation and actually fly into diminishing visibility to see what less than 10sm looks like (then retreat).",
    "mission_description" : "Launch from KPAO, cross to KHAF on a less than ideal day, then continue down to KMRY and observe marine layer along the route. See if conditions permit landing at KMRY land with a return via Salinas Valley, otherwise divert inland. Talk to Norcal Approach on the return trip to transition SJC if marine layer is moving inland.",
    "created_at" : null
  }, {
    "category" : "Weather & Atmospheric",
    "why_description" : "Central Valley heat forces performance management and teaches you to expect summer bumps.",
    "difficulty" : 6,
    "suggested_route" : null,
    "route" : "KPAO → Fresno (KFAT) on a summer afternoon",
    "title" : "Central Valley Summer Ops: Fresno (KFAT) or Bakersfield (KBFL)",
    "updated_at" : null,
    "notes" : "Calculate takeoff and landing performance meticulously. Expect reduced climb rates and higher true airspeeds. Be prepared for turbulence and reduced visibility due to haze.",
    "objective" : "Hot-day density altitude, haze, and convective turbulence practice.",
    "mission_description" : "Fly to FAT or BFL on a summer afternoon, plan climb performance carefully.",
    "created_at" : null
  }, {
    "category" : "Navigation & Diversions",
    "why_description" : "Builds redundancy for \"lost comms/lost GPS\" scenarios, a true pilot skill.",
    "difficulty" : 4,
    "suggested_route" : null,
    "route" : "KPAO → Lampson Field (1O2)",
    "title" : "Old-School Cross-Country: KPAO → 1O2 (Lampson Field)",
    "updated_at" : null,
    "notes" : "Use only sectional charts, a plotter, and E6B. Pre-calculate headings, times, and fuel. Identify clear visual checkpoints.",
    "objective" : "Dead reckoning and pilotage without GPS or ForeFlight.",
    "mission_description" : "Navigate with sectional and time/fuel calculations only. Check accuracy upon arrival.",
    "created_at" : null
  }, {
    "category" : "Navigation & Diversions",
    "why_description" : "Reinforces flexible thinking and in-flight replanning.",
    "difficulty" : 3,
    "suggested_route" : null,
    "route" : "KPAO → Redding (KRDD) initially, then halfway request diversion to Red Bluff (KRBL) or Chico (KCIC)",
    "title" : "Enroute Diversion Drill: KPAO → Redding (KRDD)",
    "updated_at" : null,
    "notes" : "KSAC is another good divert candidate. Hard to see! Have alternate airport information readily available. Practice quickly recalculating headings, times, and fuel.",
    "objective" : "Practice real-time diversion under ATC advisories and \"bigger FBO\" ops for refueling.",
    "mission_description" : "Plan for Redding, but halfway request a diversion to Red Bluff (KRBL) or Chico (KCIC).",
    "created_at" : null
  }, {
    "category" : "General Training",
    "why_description" : "Improves radio discipline, situational awareness, and confidence in chaos.",
    "difficulty" : 2,
    "suggested_route" : null,
    "route" : "Pattern work at Reid-Hillview (KRHV) during peak hours",
    "title" : "Busy GA and Training Hub: Reid-Hillview (KRHV)",
    "updated_at" : null,
    "notes" : "Listen attentively to traffic calls. Announce your intentions clearly and concisely. Be prepared for unexpected maneuvers by other aircraft.",
    "objective" : "Handle crowded training airport CTAF with 2 runways, sequencing with multiple student pilots.",
    "mission_description" : "Pattern work at KRHV during peak hours.",
    "created_at" : null
  }, {
    "category" : "Airport Operations",
    "why_description" : "Makes future \"big airport\" visits less daunting.",
    "difficulty" : 4,
    "suggested_route" : null,
    "route" : "Fly into Oakland (KOAK), ask for intersection departure or cross-field taxi",
    "title" : "Big Runway, Big Company: Oakland (KOAK)",
    "updated_at" : null,
    "notes" : "Do patterns on 33, first time with a CFI. Request a taxi diagram. Listen carefully to complex taxi instructions. Be aware of wake turbulence from larger aircraft.",
    "objective" : "Learn to taxi and operate comfortably at a large, complex Class C with parallel airline ops.",
    "mission_description" : "Fly into KOAK, ask for intersection departure or cross-field taxi.",
    "created_at" : null
  }, {
    "category" : "Endurance & Planning",
    "why_description" : "Expands comfort zone beyond Bay Area \"day trip\" radius, see the scenic Columbia Gorge!",
    "difficulty" : 6,
    "suggested_route" : null,
    "route" : "KPAO → Columbia Gorge, OR (KDLS), refuel at S03 (Siskiyou County). Optional overnight.",
    "title" : "Longer Leg: KPAO → Columbia Gorge, OR (KDLS)",
    "updated_at" : null,
    "notes" : "Plan for a long leg (300-350 nm). Monitor enroute weather closely. Consider a pilot log and hydration.",
    "objective" : "Stretch fuel planning, weather decision-making, and personal endurance limits.",
    "mission_description" : "Plan for a 300–350 nm leg, refuel at S03, optional overnight.",
    "created_at" : null
  }, {
    "category" : "Airspace Operations",
    "why_description" : "Combines high-altitude ops with ATC-heavy destinations.",
    "difficulty" : 9,
    "suggested_route" : null,
    "route" : "KPAO → Truckee (KTRK) → Reno (KRNO), refuel and return",
    "title" : "Altitude + Charlie Run: KPAO → Reno (KRNO) via Truckee",
    "updated_at" : null,
    "notes" : "See prior mission notes about pulse O2 measurements and possible supplemental O2 supplies. Review hypoxia symptoms with PIC + passengers before take-off. Plan climb performance over the mountains.",
    "objective" : "Mix mountain flying, Class C ops, and long-range navigation.",
    "mission_description" : "Depart via TRK → KRNO, refuel and return.",
    "created_at" : null
  }, {
    "category" : "Terrain & Environment",
    "why_description" : "Multiple MOA ops requiring comms. Find a small airport in a mountain valley.",
    "difficulty" : 9,
    "suggested_route" : null,
    "route" : "KPAO -> Hawthorne Industrial (KHTH). Depart over multiple MOAs, contacting White Peak on 120.725 for MOA transit clearance.",
    "title" : "Middle of the mountains destination: Hawthorne Industrial (KHTH)",
    "updated_at" : null,
    "notes" : "Recommend supplemental O2. Trips over Yosemite definitely involve high terrain and national park AGL clearances above this. Measure blood oxygen levels carefully - some people are more altitude resistant than others! Research MOA operating times and procedures. Be prepared for limited services at KHTH.",
    "objective" : "Fly over challenging mountain terrain for an airport with a high density altitude and a munitions storage area but is otherwise in the middle of nowhere.",
    "mission_description" : "Depart over multiple MOAs, contacting White Peak on 120.725 to ensure MOA transit is clear.",
    "created_at" : null
  }, {
    "category" : "Terrain & Environment",
    "why_description" : "Pushes high-altitude flight to its limits, demanding precise planning and keen mountain weather judgment.",
    "difficulty" : 9,
    "suggested_route" : null,
    "route" : "KPAO → Lone Pine (O26) or Mammoth Lakes (KMMH)",
    "title" : "High Sierra Crossing: KPAO → Lone Pine (O26) or Mammoth Lakes (KMMH)",
    "updated_at" : null,
    "notes" : "Climb early for terrain clearance. Plan for significant performance reduction at high altitudes. Study mountain weather patterns.",
    "objective" : "Conquer high mountain passes, extreme density altitude, and remote airstrips.",
    "mission_description" : "Depart KPAO, climb early for terrain clearance over the Sierras, land at O26 or KMMH. Plan for significant performance reduction.",
    "created_at" : null
  }, {
    "category" : "Weather & Atmospheric",
    "why_description" : "Builds resilience in severe conditions, forcing comprehensive pre-flight and in-flight performance management.",
    "difficulty" : 7,
    "suggested_route" : null,
    "route" : "KPAO → Death Valley (L06) or Lake Havasu (KHII) on a hot summer day",
    "title" : "Desert Hot Run: KPAO → Death Valley (L06) or Lake Havasu (KHII)",
    "updated_at" : null,
    "notes" : "Furnace Creek is super rough, do not go in there with wheel pants or fabric airplane with low ground clearance (rocks will beat up the belly). Practice short field landings/takeoffs in high temperatures. Carry extra water. Be prepared for strong thermals and turbulence.",
    "objective" : "Experience extreme desert heat, strong thermals, and remote VFR operations in challenging conditions.",
    "mission_description" : "Fly to L06 or KHII on a hot summer day. Practice short field landings/takeoffs in high temps.",
    "created_at" : null
  }, {
    "category" : "Endurance & Planning",
    "why_description" : "Simulates backcountry flying, enhancing resourcefulness, pre-flight diligence, and adaptability to unexpected conditions.",
    "difficulty" : 4,
    "suggested_route" : null,
    "route" : "KPAO → Shelter Cove (0Q5) or Columbia (O22). Plan for an overnight stay with limited resources.",
    "title" : "Overnight Trip: KPAO → Shelter Cove (0Q5) or Columbia (O22)",
    "updated_at" : null,
    "notes" : "0Q5 is coastal with a short, often foggy runway. O22 is in a mountain valley with challenging winds. Pack essentials for an overnight stay.",
    "objective" : "Navigate to a truly remote, often challenging airstrip with minimal services, requiring self-sufficiency and careful planning.",
    "mission_description" : "Fly to 0Q5 (coastal, short runway, often foggy) or O22 (mountain valley, challenging winds). Plan for overnight stay with limited resources.",
    "created_at" : null
  } ]
}